doom.d/config.org
#+TITLE: Emacs Configuration
# #+PROPERTY: header-args:emacs-lisp :tangle /home/munra/.doom.d/config.el
#+PROPERTY: header-args :tangle /home/munra/.doom.d/config.el
#+AUTHOR: Cesar Rodriguez

* TABLE OF CONTENTS :toc:
- [[#general][General]]
  - [[#splash-screen][Splash Screen]]
- [[#user-name-and-email][User name and email]]
- [[#font][Font]]
- [[#theme][Theme]]
- [[#transparency][Transparency]]
- [[#org-mode][Org mode]]
- [[#line-numbers][Line numbers]]
- [[#centaur-tabs][Centaur Tabs]]
- [[#fringe][Fringe]]
- [[#parenthesis][Parenthesis]]
- [[#modline][Modline]]
- [[#undo-tree-mode][Undo-tree-mode]]
- [[#writeroom-configs][WriteRoom Configs]]
- [[#darkroom][Darkroom]]
- [[#company-mode][Company-mode]]
- [[#nyan-mode][Nyan-mode]]
- [[#ligatures][Ligatures]]
- [[#custom-functions-and-commands][Custom functions and Commands]]
  - [[#move-to-beginning-of-line][Move to beginning of line]]
  - [[#write-with-w-and-w][Write with "W" and "w"]]
  - [[#exit-insert-mode-by-pressing-k-and-then-j-quickly][Exit insert mode by pressing k and then j quickly]]
  - [[#startup-performance][Startup Performance]]
- [[#python][Python]]
- [[#miscellaneous][Miscellaneous]]
  - [[#clock][Clock]]
  - [[#ivy][Ivy]]
  - [[#beacon-highlight-the-cursor-position][Beacon (highlight the cursor position)]]
  - [[#org-appear][org-appear]]

* General

Here are some additional functions/macros that could help you configure Doom:

 + `load!' for loading external *.el files relative to this one
 + `use-package!' for configuring packages
 + `after!' for running code after a package has loaded
 + `add-load-path!' for adding directories to the `load-path', relative to
   this file. Emacs searches the `load-path' when you load packages with
   `require' or `use-package'.
 + `map!' for binding new keys

 To get information about any of these functions/macros, move the cursor over
 the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
 This will open documentation for it, including demos of how they are use.

 You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
 they are implemented.

** Splash Screen
This code was took from:
https://github.com/tecosaur/emacs-config/blob/master/config.org#splash-screen

#+begin_src emacs-lisp

(defvar fancy-splash-image-template
  (expand-file-name "/home/munra/.doom.d/misc/emacs-e.svg" doom-private-dir)
  "Default template svg used for the splash image, with substitutions from ")

(defvar fancy-splash-sizes
  `((:height 300 :min-height 50 :padding (0 . 2))
    (:height 250 :min-height 42 :padding (2 . 4))
    (:height 200 :min-height 35 :padding (3 . 3))
    (:height 150 :min-height 28 :padding (3 . 3))
    (:height 100 :min-height 20 :padding (2 . 2))
    (:height 75  :min-height 15 :padding (2 . 1))
    (:height 50  :min-height 10 :padding (1 . 0))
    (:height 1   :min-height 0  :padding (0 . 0)))
  "list of plists with the following properties
  :height the height of the image
  :min-height minimum `frame-height' for image
  :padding `+doom-dashboard-banner-padding' (top . bottom) to apply
  :template non-default template file
  :file file to use instead of template")

(defvar fancy-splash-template-colours
  '(("$colour1" . keywords) ("$colour2" . type) ("$colour3" . base5) ("$colour4" . base8))
  "list of colour-replacement alists of the form (\"$placeholder\" . 'theme-colour) which applied the template")

(unless (file-exists-p (expand-file-name "theme-splashes" doom-cache-dir))
  (make-directory (expand-file-name "theme-splashes" doom-cache-dir) t))

(defun fancy-splash-filename (theme-name height)
  (expand-file-name (concat (file-name-as-directory "theme-splashes")
                            theme-name
                            "-" (number-to-string height) ".svg")
                    doom-cache-dir))

(defun fancy-splash-clear-cache ()
  "Delete all cached fancy splash images"
  (interactive)
  (delete-directory (expand-file-name "theme-splashes" doom-cache-dir) t)
  (message "Cache cleared!"))

(defun fancy-splash-generate-image (template height)
  "Read TEMPLATE and create an image if HEIGHT with colour substitutions as
   described by `fancy-splash-template-colours' for the current theme"
  (with-temp-buffer
    (insert-file-contents template)
    (re-search-forward "$height" nil t)
    (replace-match (number-to-string height) nil nil)
    (dolist (substitution fancy-splash-template-colours)
      (goto-char (point-min))
      (while (re-search-forward (car substitution) nil t)
        (replace-match (doom-color (cdr substitution)) nil nil)))
    (write-region nil nil
                  (fancy-splash-filename (symbol-name doom-theme) height) nil nil)))

(defun fancy-splash-generate-images ()
  "Perform `fancy-splash-generate-image' in bulk"
  (dolist (size fancy-splash-sizes)
    (unless (plist-get size :file)
      (fancy-splash-generate-image (or (plist-get size :template)
                                       fancy-splash-image-template)
                                   (plist-get size :height)))))

(defun ensure-theme-splash-images-exist (&optional height)
  (unless (file-exists-p (fancy-splash-filename
                          (symbol-name doom-theme)
                          (or height
                              (plist-get (car fancy-splash-sizes) :height))))
    (fancy-splash-generate-images)))

(defun get-appropriate-splash ()
  (let ((height (frame-height)))
    (cl-some (lambda (size) (when (>= height (plist-get size :min-height)) size))
             fancy-splash-sizes)))

(setq fancy-splash-last-size nil)
(setq fancy-splash-last-theme nil)
(defun set-appropriate-splash (&rest _)
  (let ((appropriate-image (get-appropriate-splash)))
    (unless (and (equal appropriate-image fancy-splash-last-size)
                 (equal doom-theme fancy-splash-last-theme)))
    (unless (plist-get appropriate-image :file)
      (ensure-theme-splash-images-exist (plist-get appropriate-image :height)))
    (setq fancy-splash-image
          (or (plist-get appropriate-image :file)
              (fancy-splash-filename (symbol-name doom-theme) (plist-get appropriate-image :height))))
    (setq +doom-dashboard-banner-padding (plist-get appropriate-image :padding))
    (setq fancy-splash-last-size appropriate-image)
    (setq fancy-splash-last-theme doom-theme)
    (+doom-dashboard-reload)))

(add-hook 'window-size-change-functions #'set-appropriate-splash)
(add-hook 'doom-load-theme-hook #'set-appropriate-splash)
#+end_src

* User name and email
Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.

#+begin_src emacs-lisp

(setq user-full-name "John Doe"
      user-mail-address "john@doe.com")
(require 'cl)
#+end_src

* Font
Doom exposes five (optional) variables for controlling fonts in Doom. Here
are the three important ones:

 + `doom-font'
 + `doom-variable-pitch-font'
 + `doom-big-font' -- used for `doom-big-font-mode'; use this for
    presentations or streaming.

Settings related to fonts within Doom Emacs:

     ‘doom-font’ – standard monospace font that is used for most things in Emacs.
     ‘doom-variable-pitch-font’ – variable font which is useful in some Emacs plugins.
     ‘doom-big-font’ – used in doom-big-font-mode; useful for presentations.
     ‘font-lock-comment-face’ – for comments.
     ‘font-lock-keyword-face’ – for keywords with special significance, like ‘for’ and ‘if’ in C.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
font string. You generally only need these two:

;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; (setq doom-font (font-spec :family "JetBrains Mono" :size 22 :weight 'Medium)
;;        doom-big-font (font-spec :family "JetBrains Mono" :size 25)
;;        doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 22 :weight 'Bold))
;; (setq-default line-spacing 4)

;; (setq doom-font (font-spec :family "Hack" :size 22 :weight 'Regular :height 170)
;;        doom-variable-pitch-font (font-spec :family "Hack" :size 20 :height 170)
;;        doom-big-font (font-spec :family "Hack" :size 24 :height 170))

;; (setq doom-font (font-spec :family "JetBrains Mono NL" :size 24 :weight 'ExtraBold :height 230)
;;        doom-variable-pitch-font (font-spec :family "JetBrains Mono NL" :size 24 :height 230)
;;        doom-big-font (font-spec :family "JetBrains Mono NL" :size 24 :height 230)
;;        doom-serif-font (font-spec :family "JetBrains Mono NL" :size 24 :height 230))


;; (setq doom-font (font-spec :family "Iosevka Extended" :size 23 :weight 'ExtraBold :height 230)
;;        doom-variable-pitch-font (font-spec :family "Iosevka Extended" :size 23 :height 230)
;;        doom-big-font (font-spec :family "Iosevka Extended" :size 23 :height 230)
;;        doom-serif-font (font-spec :family "Iosevka Extended" :size 23 :height 230))

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrainsMono NL" :size 23 :weight 'ExtraBold :height 230)
       doom-variable-pitch-font (font-spec :family "JetBrainsMono NL" :size 23 :height 230)
       doom-unicode-font (font-spec :family "JuliaMono" :size 23 :height 230)
       doom-big-font (font-spec :family "JetBrainsMono NL" :size 23 :height 230)
       doom-serif-font (font-spec :family "JetBrainsMono NL" :size 23 :height 230))
#+end_src

;; (setq doom-font (font-spec :family "JetBrains Mono" :size 23 :weight 'ExtraBold :height 230)
;;        doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 23 :height 230)
;;        doom-big-font (font-spec :family "JetBrains Mono" :size 23 :height 230))

;; (setq doom-font (font-spec :family "Cascadia Code" :size 25 :weight 'SemiBold :height 230)
;;        doom-variable-pitch-font (font-spec :family "Cascadia Code" :size 25 :height 230)
;;        doom-big-font (font-spec :family "Cascadia Code" :size 25 :height 230))

#+begin_src emacs-lisp

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

#+end_src

#+begin_src emacs-lisp

(setq line-spacing 0.2)

#+end_src

* Theme
 There are two ways to load a theme. Both *assume* the theme is installed and
 available. You can either set `doom-theme' or manually load a theme with the
 `load-theme' function. This is the default:
;;(setq doom-theme 'doom-one)

#+begin_src emacs-lisp

(setq doom-theme 'doom-gruvbox)

#+end_src

* Transparency

Config transparency code from https://github.com/dwcoates/doom-emacs-config/blob/master/config.el

#+begin_src emacs-lisp

(defconst doom-frame-transparency 95)
(set-frame-parameter (selected-frame) 'alpha doom-frame-transparency)
(add-to-list 'default-frame-alist `(alpha . ,doom-frame-transparency))
(defun dwc-smart-transparent-frame ()
  (set-frame-parameter
    (selected-frame)
    'alpha (if (frame-parameter (selected-frame) 'fullscreen)
              100
             doom-frame-transparency)))

#+end_src

This is another config for Set frame transparency and maximize windows by default.
Not tested.

;; (unless dw/is-termux
;;   (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
;;   (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
;;   (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
;;   (add-to-list 'default-frame-alist '(fullscreen . maximized)))



