doom.d/config.el
(setq user-full-name "John Doe"
      user-mail-address "john@doe.com")
(require 'cl)

(setq doom-font (font-spec :family "JetBrainsMono NL" :size 24 :weight 'ExtraBold :height 230)
       doom-variable-pitch-font (font-spec :family "JetBrainsMono NL" :size 24 :height 230)
       doom-big-font (font-spec :family "JetBrainsMono NL" :size 24 :height 230)
       doom-serif-font (font-spec :family "JetBrainsMono NL" :size 24 :height 230))

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

(setq line-spacing 0.2)

(setq doom-theme 'doom-gruvbox)

(defconst doom-frame-transparency 95)
(set-frame-parameter (selected-frame) 'alpha doom-frame-transparency)
(add-to-list 'default-frame-alist `(alpha . ,doom-frame-transparency))
(defun dwc-smart-transparent-frame ()
  (set-frame-parameter
    (selected-frame)
    'alpha (if (frame-parameter (selected-frame) 'fullscreen)
              100
             doom-frame-transparency)))

(after! org
