doom.d/config.org
* Ligatures
#+begin_src emacs-lisp

;; (defconst jetbrains-ligature-mode--ligatures
;;    '("-->" "//" "/**" "/*" "*/" "<!--" ":=" "->>" "<<-" "->" "<-"
;;      "<=>" "==" "!=" "<=" ">=" "=:=" "!==" "&&" "||" "..." ".."
;;      "|||" "///" "&&&" "===" "++" "--" "=>" "|>" "<|" "||>" "<||"
;;      "|||>" "<|||" ">>" "<<" "::=" "|]" "[|" "{|" "|}"
;;      "[<" ">]" ":?>" ":?" "/=" "[||]" "!!" "?:" "?." "::"
;;      "+++" "??" "###" "##" ":::" "####" ".?" "?=" "=!=" "<|>"
;;      "<:" ":<" ":>" ">:" "<>" "***" ";;" "/==" ".=" ".-" "__"
;;      "=/=" "<-<" "<<<" ">>>" "<=<" "<<=" "<==" "<==>" "==>" "=>>"
;;      ">=>" ">>=" ">>-" ">-" "<~>" "-<" "-<<" "=<<" "---" "<-|"
;;      "<=|" "/\\" "\\/" "|=>" "|~>" "<~~" "<~" "~~" "~~>" "~>"
;;      "<$>" "<$" "$>" "<+>" "<+" "+>" "<*>" "<*" "*>" "</>" "</" "/>"
;;      "<->" "..<" "~=" "~-" "-~" "~@" "^=" "-|" "_|_" "|-" "||-"
;;      "|=" "||=" "#{" "#[" "]#" "#(" "#?" "#_" "#_(" "#:" "#!" "#="
;;      "&="))

;; (dolist (pat jetbrains-ligature-mode--ligatures)
;;   (set-char-table-range composition-function-table
;;                       (aref pat 0)
;;                       (nconc (char-table-range composition-function-table (aref pat 0))
;;                              (list (vector (regexp-quote pat)
;;                                            0
;;                                     'compose-gstring-for-graphic)))))

#+end_src

* Custom functions and Commands

** Move to beginning of line

This function was taked from: https://pages.sachachua.com/.emacs.d/Sacha.html which was
inspired by  http://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/


#+begin_src emacs-lisp

(defun my/smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

;; remap C-a to `smarter-move-beginning-of-line'
(global-set-key [remap (evil-digit-argument-or-evil-beginning-of-line)]
                'my/smarter-move-beginning-of-line)

#+end_src

** Write with "W" and "w"
doom.d/config.el

#+begin_src emacs-lisp

(evil-ex-define-cmd "W" #'evil-write)

#+end_src

** Exit insert mode by pressing k and then j quickly

#+begin_src emacs-lisp

(setq key-chord-two-keys-delay 0.5)
(key-chord-define evil-insert-state-map "kj" 'evil-normal-state)
(key-chord-mode 1)

#+end_src

** Startup Performance
Doesn't seem to work in Doom Emacs but apparently doesn't hurt to the config.
Anyway better don't take the risk, comment this one.

;; ;; The default is 800 kilobytes.  Measured in bytes.
;; (setq gc-cons-threshold (* 50 1000 1000))

;; ;; Profile emacs startup
;; (add-hook 'emacs-startup-hook
;;           (lambda ()
;;             (message "*** Emacs loaded in %s with %d garbage collections."
;;                      (format "%.2f seconds"
;;                              (float-time
;;                               (time-subtract after-init-time before-init-time)))
;;                      gcs-done)))

* Python
Preferred mode of ~M-x run-python~

;; (require 'python)
;; (setq python-shell-interpreter "ipython")
;; (setq python-shell-interpreter-args "--pylab")


* Miscellaneous

I find it useful to have a slightly more apparent indicator of which buffer is active at the moment.

;; (use-package dimmer
;;   :custom (dimmer-fraction 0.1)
;;   :config (dimmer-mode))


;; (use-package crosshairs
;; ;;  :enabled
;; ;;  :defer nil
;;   :config
;;   (crosshairs-mode))

Confirm-kill-emacs is non-nil by default. The doom-quit module only
adds silly confirmation messages to it. To disable it completely:

#+begin_src emacs-lisp

(setq confirm-kill-emacs nil)

#+end_src

Highlight current column
;; (column-highlight-mode 1)
;; (set-face-attribute 'col-highlight nil :inherit 'hl-line :background)

Enable and configure recentf-mode (recent-files)
;; (setq recentf-max-saved-items 200)
;; (setq recentf-max-menu-items 50)

Diminish
;; (use-package diminish :defer t)

(setq ispell-dictionary "american")

(setq shell-pop-window-size 50)

Sublimity config
;; (require 'sublimity-scroll)
;; (require 'sublimity-map)
;; (require 'sublimity-attractive)
;; (sublimity-mode 1)

OR

;; (setq sublimity-map-size 20)
;; (setq sublimity-map-fraction 0.3)
;; (setq sublimity-map-text-scale -7)

#+begin_src emacs-lisp

(use-package minions
  :config
  (setq minions-mode-line-lighter "")
  (setq minions-mode-line-delimiters '("" . ""))
  (minions-mode +1))

#+end_src

#+begin_src emacs-lisp

(use-package vterm
  :commands vterm
  :config
  (setq vterm-max-scrollback 100000))

#+end_src

Make cursor the width of the character it is under i.e. full width of a TAB

#+begin_src emacs-lisp

(setq x-stretch-cursor t)

#+end_src


** Clock

;; (display-time-mode 1)

** Ivy

Info take from: https://github.com/tumashu/ivy-posframe

+ ivy-posframe-display-at-frame-center
+ ivy-posframe-display-at-window-center
+ ivy-posframe-display-at-frame-bottom-left
+ ivy-posframe-display-at-window-bottom-left
+ ivy-posframe-display-at-frame-bottom-window-center
+ ivy-posframe-display-at-point

#+begin_src emacs-lisp
(use-package ivy-posframe
  :after ivy
  :diminish
  :custom-face
  (ivy-posframe-border ((t (:background "#8f3f71"))))
  :config
  (setq ivy-posframe-parameters
      '((left-fringe . 8)
        (right-fringe . 8)))
  (setq ivy-posframe-parameters '((internal-border-width . 2)))
  (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-bottom-window-center)))
  (ivy-posframe-mode +1))
#+end_src

** Beacon (highlight the cursor position)

#+begin_src emacs-lisp

(use-package beacon
  :ensure t
  :config
  (setq beacon-blink-when-point-moves-vertically 2) ; default nil
  (setq beacon-blink-when-point-moves-horizontally 2) ; default nil
  (setq beacon-blink-when-buffer-changes t) ; default t
  (setq beacon-blink-when-window-scrolls t) ; default t
  (setq beacon-blink-when-window-changes t) ; default t
  (setq beacon-blink-when-focused t) ; default nil
  (setq beacon-blink-duration 0.5) ; default 0.3
  (setq beacon-blink-delay 0.5) ; default 0.3
  (setq beacon-size 10) ; default 40
  ;; (setq beacon-color "yellow") ; default 0.5
  (setq beacon-color 0.5) ; default 0.5
  (setq beacon-push-mark 10) ;????, what this mean?
  (beacon-mode 1))

#+end_src

** org-appear

Enables automatic visibility toggling depending on cursor position. Hidden element parts appear when the cursor enters an element and disappear when it leaves.

#+begin_src emacs-lisp

(add-hook 'org-mode-hook 'org-appear-mode)

#+end_src
